bench/results/java11/20260425T082800Z/load.stdout.txt
{"ok": true, "tool": "wrk", "url": "http://localhost:8080/api/gateway/orders", "duration_s": 120, "warmup_s": 60, "concurrency": 25, "threads": 4, "requests_per_sec": 7335.72, "p50": "3.11ms", "p95": "5.54ms", "p99": "6.49ms", "http_non2xx": "na", "socket_errors": {}, "raw_excerpt": "Running 2m test @ http://localhost:8080/api/gateway/orders\n  4 threads and 25 connections\n  Thread Stats   Avg      Stdev     Max   +/- Stdev\n    Latency     3.27ms    1.04ms  23.05ms   72.41%\n    Req/Sec     1.84k   151.55     2.11k    79.46%\n  Latency Distribution\n     50%    3.11ms\n     75%    3.82ms\n     90%    4.60ms\n     99%    6.49ms\n  880574 requests in 2.00m, 200.71MB read\nRequests/sec:   7335.72\nTransfer/sec:      1.67MB"}